Documents/Заказ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>Заказ</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтадииДоставкиЗаказа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курьер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Курьеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/СтадииДоставкиЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СтадииДоставкиЗаказа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПодборКурьера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Начат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доставляется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Задерживается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доставлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Заказ/Forms/КурьерскаяФормаДокументаДляДоставок/Ext/Form/Module.bsl
&НаКлиенте
Процедура ДоставилКлиенту(Команда)  
	ДоставитьЗаказНаСервере();
	Закрыть();
КонецПроцедуры  

&НаКлиенте
Процедура ЗабралИзМагазина(Команда) 
	ЗабратьЗаказИзМагазинаНаСервере();
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьДоставку(Команда)    
	ОтменитьЗаказНаСервере();	
	Закрыть();
КонецПроцедуры


&НаСервере
Процедура ДоставитьЗаказНаСервере()   
	Объект.Состояние = Перечисления.СтадииДоставкиЗаказа.Доставлен;
	ЭтаФорма.Записать();
КонецПроцедуры  

&НаСервере
Процедура ЗабратьЗаказИзМагазинаНаСервере()   
	Объект.Состояние = Перечисления.СтадииДоставкиЗаказа.Доставляется;
	ЭтаФорма.Записать();
КонецПроцедуры

&НаСервере
Процедура ОтменитьЗаказНаСервере()   
	Объект.Состояние = Перечисления.СтадииДоставкиЗаказа.Отменен;
	ЭтаФорма.Записать();
КонецПроцедуры
